Tekla Open API Reference for Tekla Structures 2025
ErrorDialog.Show Method (String, String, ErrorDialog.Severity)
 Shows a new error dialog.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void Show(
	string Message,
	string Details,
	ErrorDialog.Severity Severity
)
Public Shared Sub Show (
	Message As String,
	Details As String,
	Severity As ErrorDialog.Severity
)
Parameters
Message
Type: System.String
The message to display in the dialog.
Details
Type: System.String
The details to display in the dialog.
Severity
Type: Tekla.Structures.Dialog.ErrorDialog.Severity
The severity of the message.
See Also
Reference
ErrorDialog Class
Show Overload
Tekla.Structures.Dialog Namespace